Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_6 (InputLayer)         [(None, 14)]              0         
_________________________________________________________________
dense_5 (Dense)              (None, 36)                540       
_________________________________________________________________
batch_normalization_2 (Batch (None, 36)                144       
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 37        
=================================================================
Total params: 721
Trainable params: 649
Non-trainable params: 72
_________________________________________________________________