Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_7 (InputLayer)         [(None, 14)]              0         
_________________________________________________________________
dense_7 (Dense)              (None, 10)                150       
_________________________________________________________________
batch_normalization_3 (Batch (None, 10)                40        
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 11        
=================================================================
Total params: 201
Trainable params: 181
Non-trainable params: 20
_________________________________________________________________